## DATAFRAME
#### it is like tabular format
#### creating dataframe
#### ->list of dictionaries
#### ->dict of list
#### ->from series

## uses of dataframes
#### we can rename row/col
#### we can drop or add rows/cols
#### we can acces the values using indexing and slicing

In [4]:
import numpy as np
import pandas as pd

In [10]:
a=np.array([1,2,3])
df=pd.DataFrame(a)
df

   0
0  1
1  2
2  3

In [12]:
df.index=["a","b","c"]
df

   0
a  1
b  2
c  3

In [33]:
# from list of dict
l1=[{1:"a",2:"b"},{1:[1,2]}]
df1=pd.DataFrame(l1)
df1.index=["x","y"]
df1

        1    2
x       a    b
y  [1, 2]  NaN

In [36]:
#from dict of list
d={1:[1,2,3],2:[2,3,4],3:[3,4,5],4:[4,5,6]}
df2=pd.DataFrame(d)
df2

   1  2  3  4
0  1  2  3  4
1  2  3  4  5
2  3  4  5  6

In [37]:
#from series
s1=pd.Series([1,2,3],["a","b","c"])
s1

a    1
b    2
c    3
dtype: int64

In [38]:
s2=pd.Series([10,20,30],["a","g","h"])
s2

a    10
g    20
h    30
dtype: int64

In [40]:
df=pd.DataFrame([s1,s2])
df

      a    b    c     g     h
0   1.0  2.0  3.0   NaN   NaN
1  10.0  NaN  NaN  20.0  30.0

## Operations

### renaminng

In [107]:
df=df.rename({"a":"q","b":"w"},axis=1)

In [108]:
df.rename({0:"r1",1:"r2"})

        q      w      c      g      h    i    i
r1    1.0    2.0    3.0    NaN    NaN   40   40
r2   10.0    NaN    NaN   20.0   30.0   50   50
r3    1.0    2.0    3.0    4.0    5.0    6    7
r4  100.0  200.0  300.0  400.0  500.0  600  700

## indexing

### using iloc[] we can specify row and column indexes

In [51]:
df["q"]

0     1.0
1    10.0
Name: q, dtype: float64

In [54]:
df[0:1]

     q    w    c   g   h
0  1.0  2.0  3.0 NaN NaN

In [55]:
df[0:2]

      q    w    c     g     h
0   1.0  2.0  3.0   NaN   NaN
1  10.0  NaN  NaN  20.0  30.0

In [56]:
df["q"]

0     1.0
1    10.0
Name: q, dtype: float64

In [58]:
df.iloc[0:1,0:3]

     q    w    c
0  1.0  2.0  3.0

In [61]:
df.iloc[0,[0,2]]

q    1.0
c    3.0
Name: 0, dtype: float64

In [64]:
df.iloc[[1,0],[0,2]]

      q    c
1  10.0  NaN
0   1.0  3.0

### using loc[]  it relies on labels,if ur dataframe have custom lables u need to use them
###### if labels are integers, there might be confusion between using integer positions and actual lables

In [69]:
df.loc[:,"q":"c"]

      q    w    c
0   1.0  2.0  3.0
1  10.0  NaN  NaN

## Adding new rows

In [80]:
df["r3"]=[40,50]
df

      q    w    c     g     h   i  r3
0   1.0  2.0  3.0   NaN   NaN  40  40
1  10.0  NaN  NaN  20.0  30.0  50  50

In [81]:
df=df.rename({"r3":"i"},axis=1)
df

      q    w    c     g     h   i   i
0   1.0  2.0  3.0   NaN   NaN  40  40
1  10.0  NaN  NaN  20.0  30.0  50  50

In [86]:
df.loc["r3"]=[1,2,3,4,5,6,7]
df

       q    w    c     g     h   i   i
0    1.0  2.0  3.0   NaN   NaN  40  40
1   10.0  NaN  NaN  20.0  30.0  50  50
r3   1.0  2.0  3.0   4.0   5.0   6   7

In [90]:
df.loc["r4"]=[100,200,300,400,500,600,700]
df

        q      w      c      g      h    i    i
0     1.0    2.0    3.0    NaN    NaN   40   40
1    10.0    NaN    NaN   20.0   30.0   50   50
r3    1.0    2.0    3.0    4.0    5.0    6    7
r4  100.0  200.0  300.0  400.0  500.0  600  700

## deleting row and cols

In [91]:
df

        q      w      c      g      h    i    i
0     1.0    2.0    3.0    NaN    NaN   40   40
1    10.0    NaN    NaN   20.0   30.0   50   50
r3    1.0    2.0    3.0    4.0    5.0    6    7
r4  100.0  200.0  300.0  400.0  500.0  600  700

In [94]:
df.drop("r4",axis="rows")

       q    w    c     g     h   i   i
0    1.0  2.0  3.0   NaN   NaN  40  40
1   10.0  NaN  NaN  20.0  30.0  50  50
r3   1.0  2.0  3.0   4.0   5.0   6   7

In [95]:
df

        q      w      c      g      h    i    i
0     1.0    2.0    3.0    NaN    NaN   40   40
1    10.0    NaN    NaN   20.0   30.0   50   50
r3    1.0    2.0    3.0    4.0    5.0    6    7
r4  100.0  200.0  300.0  400.0  500.0  600  700

In [96]:
df.drop("i",axis="columns")

        q      w      c      g      h
0     1.0    2.0    3.0    NaN    NaN
1    10.0    NaN    NaN   20.0   30.0
r3    1.0    2.0    3.0    4.0    5.0
r4  100.0  200.0  300.0  400.0  500.0

In [97]:
df

        q      w      c      g      h    i    i
0     1.0    2.0    3.0    NaN    NaN   40   40
1    10.0    NaN    NaN   20.0   30.0   50   50
r3    1.0    2.0    3.0    4.0    5.0    6    7
r4  100.0  200.0  300.0  400.0  500.0  600  700

## ATTRIBUTES

In [98]:
df.index

Index([0, 1, 'r3', 'r4'], dtype='object')

In [99]:
df.columns

Index(['q', 'w', 'c', 'g', 'h', 'i', 'i'], dtype='object')

In [101]:
df.values

array([[  1.,   2.,   3.,  nan,  nan,  40.,  40.],
       [ 10.,  nan,  nan,  20.,  30.,  50.,  50.],
       [  1.,   2.,   3.,   4.,   5.,   6.,   7.],
       [100., 200., 300., 400., 500., 600., 700.]])

In [102]:
df.size

28

In [103]:
df.shape

(4, 7)

In [105]:
df.head()

        q      w      c      g      h    i    i
0     1.0    2.0    3.0    NaN    NaN   40   40
1    10.0    NaN    NaN   20.0   30.0   50   50
r3    1.0    2.0    3.0    4.0    5.0    6    7
r4  100.0  200.0  300.0  400.0  500.0  600  700

In [106]:
df.tail(2)

        q      w      c      g      h    i    i
r3    1.0    2.0    3.0    4.0    5.0    6    7
r4  100.0  200.0  300.0  400.0  500.0  600  700